# Missing Data

Few convenient methods to deal with Missing Data in pandas:

In [2]:
import numpy as np
import pandas as pd

In [ ]:
pd.read_

In [3]:
edf=pd.read_csv(r"D:\ML_code\datasets\datasets\AirPassengers.csv")

In [11]:
edf.columns

Index(['Month', '#Passengers'], dtype='object')

In [12]:
edf ['PCluser'] = np.where(edf['#Passengers'] <150 , 'Few', 
         np.where(edf['#Passengers']<300, 'G2',
                  np.where(edf['#Passengers'] < 450, 'Medium','Large')))

In [15]:
edf

       Month  #Passengers PCluser
0    1949-01          112     Few
1    1949-02          118     Few
2    1949-03          132     Few
3    1949-04          129     Few
4    1949-05          121     Few
..       ...          ...     ...
139  1960-08          606   Large
140  1960-09          508   Large
141  1960-10          461   Large
142  1960-11          390  Medium
143  1960-12          432  Medium

[144 rows x 3 columns]

In [14]:
edf.PCluser.value_counts()

PCluser
G2        59
Medium    47
Few       23
Large     15
Name: count, dtype: int64

In [17]:
edf[edf['PCluser']=='Large']

       Month  #Passengers PCluser
102  1957-07          465   Large
103  1957-08          467   Large
114  1958-07          491   Large
115  1958-08          505   Large
125  1959-06          472   Large
126  1959-07          548   Large
127  1959-08          559   Large
128  1959-09          463   Large
135  1960-04          461   Large
136  1960-05          472   Large
137  1960-06          535   Large
138  1960-07          622   Large
139  1960-08          606   Large
140  1960-09          508   Large
141  1960-10          461   Large

In [6]:
edf.isna().sum()

Month          0
#Passengers    0
dtype: int64

In [5]:
from google.colab import files
data=files.upload()

ModuleNotFoundError: No module named 'google.colab'

In [6]:
#t_df= pd.read_csv("titanic_train.csv")

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'A':[1,2,np.nan,40,30,30,20],
                  'B':[5,np.nan,np.nan,20,10,20,10],
                  'C':[1,2,3,12,5,3,4],
                  'D':[10,20,30,120,50,2,1],
                  'E':['a','a','a','b','b','b',np.nan]})

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       5 non-null      float64
 2   C       7 non-null      int64
 3   D       7 non-null      int64
 4   E       6 non-null      object
dtypes: float64(2), int64(2), object(1)
memory usage: 412.0+ bytes

In [17]:
df.shape[1]

5

In [37]:
(df.isna().sum()/df.shape[0])*100

A    14.285714
B    28.571429
C     0.000000
D     0.000000
E    14.285714
dtype: float64

In [42]:
df['A'].mean()

np.float64(20.5)

In [46]:
df

      A     B   C    D        E
0   1.0   5.0   1   10        a
1   2.0   NaN   2   20        a
2  20.5   NaN   3   30        a
3  40.0  20.0  12  120        b
4  30.0  10.0   5   50        b
5  30.0  20.0   3    2        b
6  20.0  10.0   4    1  Unknown

In [47]:
for i in df.columns:
    col_na_per = (df[i].isna().sum()/df.shape[0])*100
    if col_na_per > 50:
        df.drop(i, inplace = True)
    elif col_na_per >10:
        if df[i].dtypes=='object':
            df[i].fillna('Unknown', inplace = True)
        else:
            df[i].fillna(df[i].mean(), inplace = True)

In [1]:
df

NameError: name 'df' is not defined

In [23]:
df.drop('A', axis = 1)

      B   C    D    E
0   5.0   1   10    a
1   NaN   2   20    a
2   NaN   3   30    a
3  20.0  12  120    b
4  10.0   5   50    b
5  20.0   3    2    b
6  10.0   4    1  NaN

In [24]:
df

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [7]:
df.drop('C', axis=1, inplace= True)

In [11]:
df

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [26]:
df.dropna(axis = 1)

    C    D
0   1   10
1   2   20
2   3   30
3  12  120
4   5   50
5   3    2
6   4    1

In [11]:
df

      A     B   C    D
0   1.0   5.0   1   10
1   2.0   NaN   2   20
2   NaN   NaN   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50

In [5]:
df.dropna(axis= 1)

    C    D
0   1   10
1   2   20
2   3   30
3  12  120
4   5   50
5   3    2
6   4    1

In [7]:
df.drop('B', axis=1)

      A   C    D
0   1.0   1   10
1   2.0   2   20
2   NaN   3   30
3  40.0  12  120
4  30.0   5   50
5  30.0   3    2
6  20.0   4    1

In [14]:
df

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [35]:
df.dropna(thresh=3, axis = 1)

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

###### df

In [ ]:
a**2+b**2 +2*a*b

In [3]:
np.nan+2

nan

In [7]:
df

      A     B   C    D
0   1.0   5.0   1   10
1   2.0   NaN   2   20
2   NaN   NaN   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50
5  30.0  20.0   3    2
6  20.0  10.0   4    1

In [51]:
v1 = list(zip(df.columns , df.dtypes))

In [54]:
v1[0][1]

dtype('float64')

In [50]:
df

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [53]:
col_list = [i[0] for i in list(zip(df.columns , df.dtypes)) if i[1] != 'O']

In [51]:
list_avg =df[[i[0] for i in list(zip(df.columns , df.dtypes)) if i[1] != 'O']].mean()

In [55]:
df[col_list].fillna(list_avg)

      A     B   C    D
0   1.0   5.0   1   10
1   2.0  13.0   2   20
2  20.5  13.0   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50
5  30.0  20.0   3    2
6  20.0  10.0   4    1

In [39]:
df[['A','B','C','D']].mean()

A    20.500000
B    13.000000
C     4.285714
D    33.285714
dtype: float64

In [36]:
df

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [37]:
df1 = df.fillna(100)
df1

       A      B   C    D    E
0    1.0    5.0   1   10    a
1    2.0  100.0   2   20    a
2  100.0  100.0   3   30    a
3   40.0   20.0  12  120    b
4   30.0   10.0   5   50    b
5   30.0   20.0   3    2    b
6   20.0   10.0   4    1  100

In [49]:
df[['A','B','C','D']].fillna(df[['A','B','C','D']].mean())

      A     B   C    D
0   1.0   5.0   1   10
1   2.0  13.0   2   20
2  20.5  13.0   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50
5  30.0  20.0   3    2
6  20.0  10.0   4    1

In [38]:
df

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [39]:
df.bfill()

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0  20.0   2   20    a
2  40.0  20.0   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [58]:
df.ffill()

      A     B   C    D  E
0   1.0   5.0   1   10  a
1   2.0   5.0   2   20  a
2   2.0   5.0   3   30  a
3  40.0  20.0  12  120  b
4  30.0  10.0   5   50  b
5  30.0  20.0   3    2  b
6  20.0  10.0   4    1  b

In [40]:
df.fillna(method= 'bfill', axis = 1)
df

C:\Users\ajoti\AppData\Local\Temp\ipykernel_153868\961233159.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method= 'bfill', axis = 1)
C:\Users\ajoti\AppData\Local\Temp\ipykernel_153868\961233159.py:1: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df.fillna(method= 'bfill', axis = 1)

      A     B   C    D    E
0   1.0   5.0   1   10    a
1   2.0   NaN   2   20    a
2   NaN   NaN   3   30    a
3  40.0  20.0  12  120    b
4  30.0  10.0   5   50    b
5  30.0  20.0   3    2    b
6  20.0  10.0   4    1  NaN

In [8]:
df.fillna(method= 'ffill', axis=1)

      A     B     C      D
0   1.0   5.0   1.0   10.0
1   2.0   2.0   2.0   20.0
2   NaN   NaN   3.0   30.0
3  40.0  20.0  12.0  120.0
4  30.0  10.0   5.0   50.0

In [13]:
df.ffill()

      A     B   C    D
0   1.0   5.0   1   10
1   2.0   5.0   2   20
2   2.0   5.0   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50
5  30.0  20.0   3    2
6  20.0  10.0   4    1

In [30]:
df

      A     B   C    D
0   1.0   5.0   1   10
1   2.0   NaN   2   20
2   NaN   NaN   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50

In [25]:
df['A'].mean()

18.25

In [35]:
df[df['A'].isna()]['A']=df['A'].mean()

<ipython-input-35-cd59ca339d1e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['A'].isna()]['A']=df['A'].mean()

In [21]:
df['A'][df['A'].isna()] = df['A'].mean()

<ipython-input-21-0e9ad1887f2e>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['A'][df['A'].isna()] = df['A'].mean()

In [25]:
df['A'][df['A'].isna()]=df['A'].mean()

<ipython-input-25-1e28dceb3328>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['A'][df['A'].isna()]=df['A'].mean()

In [30]:
df[df['A'].isna()]['A']=df['A'].mean()

2   NaN
Name: A, dtype: float64

In [8]:
df['A'].fillna(df['A'].mean())

0     1.00
1     2.00
2    18.25
3    40.00
4    30.00
Name: A, dtype: float64

In [26]:
df['B'].mean()

11.666666666666666

In [7]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [29]:
for i in df.columns:
    #print(i, df[i])
    #print(df[i].mean())
    df[i].fillna(df[i].mean(), inplace = True)

18.25
11.666666666666666
4.6
46.0

In [13]:
df

      A     B   C    D
0   1.0   5.0   1   10
1   2.0   NaN   2   20
2   NaN   NaN   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50

In [14]:
df.ffill()

      A     B   C    D
0   1.0   5.0   1   10
1   2.0   5.0   2   20
2   2.0   5.0   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50

In [16]:
df.ffill(axis =1)

      A     B     C      D
0   1.0   5.0   1.0   10.0
1   2.0   2.0   2.0   20.0
2   NaN   NaN   3.0   30.0
3  40.0  20.0  12.0  120.0
4  30.0  10.0   5.0   50.0

In [17]:
df.bfill()

      A     B   C    D
0   1.0   5.0   1   10
1   2.0  20.0   2   20
2  40.0  20.0   3   30
3  40.0  20.0  12  120
4  30.0  10.0   5   50

In [18]:
df.bfill(axis = 1)

      A     B     C      D
0   1.0   5.0   1.0   10.0
1   2.0   2.0   2.0   20.0
2   3.0   3.0   3.0   30.0
3  40.0  20.0  12.0  120.0
4  30.0  10.0   5.0   50.0

In [44]:
df['A'].fillna(100, inplace= True)

In [45]:
df

       A     B   C    D    E
0    1.0   5.0   1   10    a
1    2.0   NaN   2   20    a
2  100.0   NaN   3   30    a
3   40.0  20.0  12  120    b
4   30.0  10.0   5   50    b
5   30.0  20.0   3    2    b
6   20.0  10.0   4    1  NaN

In [25]:
df['B'] = df['B'].fillna(df['B'].mean())

In [46]:
df.columns

Index(['A', 'B', 'C', 'D', 'E'], dtype='object')

In [31]:
for i in df.columns:
    print(i, df[i].mean())
    df[i] = df[i].fillna(df[i].mean())

A 18.25
B 11.666666666666666
C 4.6
D 46.0

In [14]:
df.dtypes

A    float64
B    float64
C      int64
D      int64
dtype: object

In [13]:
for b in df.columns:
    print(df[b].dtypes)
    if df[b].dtypes == object:
        df[b]=df[b].fillna(df[b].mode()[0])     
    else:
        df[b]=df[b].fillna(df[b].mean())

float64
float64
int64
int64

In [17]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [16]:
df.fillna(value=df.mean())

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

In [20]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

# END

In [ ]:
df.isna().sum()

A    1
B    2
C    0
dtype: int64

In [ ]:
t_df.shape

(891, 14)

In [ ]:
t_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
s_M            889
S_F            889
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64